testdata/m4/limits/expected-deep-default.mmd
flowchart TD
  m_1b9028fe90a6["app.Deep.a()"]
  m_dd362ee05388["app.Deep.b()"]
  m_a5209eb41e02["app.Deep.c()"]
  m_fa8378f0b504["app.Deep.d()"]
  m_fa5d243d9ae8["app.Deep.e()"]
  m_8eaee5f3c821["app.Deep.f()"]
  m_1b9028fe90a6 --> m_dd362ee05388
  m_dd362ee05388 --> m_a5209eb41e02
  m_a5209eb41e02 --> m_fa8378f0b504
  m_fa8378f0b504 --> m_fa5d243d9ae8
  m_fa5d243d9ae8 --> m_8eaee5f3c821
